vmidentity/sts/src/test/resources/request/invalid_missing_assertion.xml

<?xml version='1.0' encoding='UTF-8'?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header><ns5:Security xmlns="http://docs.oasis-open.org/ws-sx/ws-trust/200512" xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ns3="http://www.rsa.com/names/2009/12/std-ext/WS-Trust1.4/advice" xmlns:ns4="http://www.w3.org/2005/08/addressing" xmlns:ns5="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><ns2:Timestamp ns2:Id="_96efe77b-7f75-475b-8799-3437e4bf9de4"><ns2:Created>2012-05-15T16:44:46.871Z</ns2:Created><ns2:Expires>2012-05-15T16:54:46.871Z</ns2:Expires></ns2:Timestamp><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha512"/><ds:Reference URI="#_41f0a5cd-aafd-41a3-8a90-73481ad340e5"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha512"/><ds:DigestValue>LGSXPT5yueUFZWH+JTAiB84SyCJu56359tNqoLW0Y5SLKuqEtlCYSilC5fW6xBPbZgmHDGqQRmxs
xMIu7nCF8A==</ds:DigestValue></ds:Reference><ds:Reference URI="#_96efe77b-7f75-475b-8799-3437e4bf9de4"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha512"/><ds:DigestValue>IR9QUFbq4vEq6y/RGSSMYRTX4z0PXD+XNdJdOUYbugTPTpshvhi5DTz8LTqZs9DVOXx9PtzzJWYo
ZAoarmHSvw==</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>bLcQOzJVS3I+/ls4nQl8pqC4UZmu1uLb2Z5PONr1GcJ0CnwLPfUO28xwQ4oT399/vHJVR94moaS0
+MK4KlTVQ+BSO3KOavkF9QXJzyg57T0Ll2v8Mcv8iJXQCNd4D25ZdRvaFz5F9G9M/H3zkzpbU1yt
ozZeZR37YIvAsXhFlJfoIeaLaboctN1AMdq8C874gkt4WCVr2+eD3Cjx//4qWL0PbyBmo5WyjOjq
VIyZZkZdepioaTaJMyQGocizDbzmWwhSawqGfVwfqPkwvdBzHuesRbO5eRxI/Uz9eqrYlDOgP/QW
5/v2iCw4Bjj8heRKfjNbjXBwR2/cMYPg8iWHcw==</ds:SignatureValue><ds:KeyInfo><ns2:SecurityTokenReference xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:ns3="http://docs.oasis-open.org/ws-sx/ws-trust/200512" xmlns:ns4="http://www.rsa.com/names/2009/12/std-ext/WS-Trust1.4/advice" xmlns:ns5="http://www.w3.org/2005/08/addressing" xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-tokenprofile-1.1#SAMLV2.0"><ns2:KeyIdentifier ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID">_3d3ea80d-aaab-4e6b-a42a-4c6c22fd5575</ns2:KeyIdentifier></ns2:SecurityTokenReference></ds:KeyInfo></ds:Signature></ns5:Security></SOAP-ENV:Header><SOAP-ENV:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="_41f0a5cd-aafd-41a3-8a90-73481ad340e5"><RequestSecurityToken xmlns="http://docs.oasis-open.org/ws-sx/ws-trust/200512" xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ns3="http://www.rsa.com/names/2009/12/std-ext/WS-Trust1.4/advice" xmlns:ns4="http://www.w3.org/2005/08/addressing" xmlns:ns5="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><TokenType>urn:oasis:names:tc:SAML:2.0:assertion</TokenType><RequestType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/Issue</RequestType><Lifetime><ns2:Created>2012-05-15T16:44:46.871Z</ns2:Created><ns2:Expires>2012-05-15T16:45:46.871Z</ns2:Expires></Lifetime><Renewing Allow="false" OK="false"/><KeyType>http://docs.oasis-open.org/ws-sx/ws-trust/200512/PublicKey</KeyType><SignatureAlgorithm>http://www.w3.org/2001/04/xmldsig-more#rsa-sha256</SignatureAlgorithm></RequestSecurityToken></SOAP-ENV:Body></SOAP-ENV:Envelope>